Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: འདི་ལྟ་སྟེ་དཔེར་ན་རི་མོ་མཁན་ནམ། རི་མོ་མཁན་གྱི་སློབ་མ་མཁས་པ་ཞིག་གིས་ཤིང་ལེབ་སྦྱངས་པའམ། རྩིག་པ་ལེགས་པར་བྱི་དོར་བྱས་པ་ལ་ཚོན་སྦྱར་ལེགས་པས་གཟུགས་གང་དང་གང་བྲི་བར་འདོད་པ་དེ་དང་། དེ་ཉིད་མངོན་པར་འགྲུབ་པར་བྱེད་དོ། །
en: “Consider this analogy: An artist or their skilled apprentice may clean a plank of wood or wipe a wall thoroughly and then apply paint to it; having properly done so, whatever form he or she then wishes to paint can then manifest.

source: དེ་དེ་ལས་རྗེས་སུ་དཔགས་ན་རི་མོ་མཁན་དེ་མཁས་པ་ཞེས་བྱའོ། །
en: It is due to inference based on such actions that the artist becomes known as a skilled artist.

source: མཽད་གལ་གྱི་བུ་དེ་བཞིན་དུ་ལས་ལས་ཉོན་མོངས་པ་རྗེས་སུ་དཔག་སྟེ།
en: Similarly, Maudgalyāyana, afflictions can be deduced based on the presence of karma;

source: ཚུལ་དེ་ལྟ་བུས་ཉོན་མོངས་པས་ལས་འདི་མངོན་པར་འདུས་བྱས་ཏེ།
en: and in the same manner, a certain karma will be created due to the presence of an affliction.

source: གལ་ཏེ་འདོད་ཆགས་ལས་སྐྱེས་པའམ། གལ་ཏེ་ཞེ་སྡང་ལས་སྐྱེས་པའམ། གལ་ཏེ་གཏི་མུག་ལས་སྐྱེས་པའམ། གལ་ཏེ་འདོད་ཆགས་དང་ཞེ་སྡང་ལས་སྐྱེས་པའམ། གལ་ཏེ་འདོད་ཆགས་དང་གཏི་མུག་ལས་སྐྱེས་པའམ། གལ་ཏེ་ཞེ་སྡང་དང་འདོད་ཆགས་ལས་སྐྱེས་པའམ། གལ་ཏེ་ཞེ་སྡང་དང་གཏི་མུག་ལས་སྐྱེས་པའམ། གལ་ཏེ་གཏི་མུག་དང་འདོད་ཆགས་ལས་སྐྱེས་པའམ། གལ་ཏེ་གཏི་མུག་དང་ཞེ་སྡང་ལས་སྐྱེས་པ་ཞེས་ལས་ལས་ཉོན་མོངས་པ་རྗེས་སུ་དཔག་ཅིང་། ཉོན་མོངས་པ་ལས་གང་ཟག་རྗེས་སུ་དཔག་གོ། །
en: It may arise from desire, from anger, from ignorance, from desire and anger, from desire and ignorance, from anger and desire, from anger and ignorance, from ignorance and desire, or from ignorance and anger—in any case the presence of an affliction can be deduced based on the presence of karma, just as the individual can be deduced based on the presence of an affliction.

source: དེ་ལ་ལས་མངོན་པར་འདུ་བྱེད་པས་གང་ཟག་རིག་པར་བྱ་སྟེ།
en: “Thus, you should understand that a person appears based on the formation of karma in this way:

source: གང་ཟག་འདི་ནི་སེམས་ཅན་དམྱལ་བ་པ། གང་ཟག་འདི་ནི་སེམས་ཅན་དམྱལ་བར་ཡང་དག་པར་གནས་པ་ཡིན།
en: ‘This individual must be a hell being, dwelling among hell beings.

source: གང་ཟག་འདི་ནི་དུད་འགྲོའི་སྐྱེ་གནས་པ། གང་ཟག་འདི་ནི་དུད་འགྲོའི་སྐྱེ་གནས་སུ་ཡང་དག་པར་གནས་པ་ཡིན།
en: This other individual must be an animal, living in the animal realm.

source: གང་ཟག་འདི་ནི་གཤིན་རྗེའི་འཇིག་རྟེན་པ། གང་ཟག་འདི་ནི་གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ཡང་དག་པར་གནས་པ་ཡིན།
en: This other individual must be a being in the realm of the Lord of Death, dwelling in the realm of the Lord of Death.

source: གང་ཟག་འདི་ནི་ལྷ་མ་ཡིན་པ། གང་ཟག་འདི་ནི་ལྷ་མ་ཡིན་གྱི་འཇིག་རྟེན་དུ་ཡང་དག་པར་གནས་པ་ཡིན།
en: This other individual must be a demigod, dwelling in the demigod realms.

source: གང་ཟག་འདི་ནི་མི། གང་ཟག་འདི་ནི་མིའི་འཇིག་རྟེན་དུ་ཡང་དག་པར་གནས་པ་ཡིན།
en: This other individual must be a human, dwelling in the realm of humans.

source: གང་ཟག་འདི་ནི་ལྷ། གང་ཟག་འདི་ནི་ལྷའི་འཇིག་རྟེན་དུ་ཡང་དག་པར་གནས་པ་ཡིན།
en: This other individual must be a god, dwelling in the god realms.

source: གང་ཟག་འདི་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ། གང་ཟག་འདི་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་ཡང་དག་པར་གནས་པ་ཡིན་ནོ། །
en: This other individual must have attained nirvāṇa, and dwells in nirvāṇa.’

source: ཞེས་ལས་ལས་ཉོན་མོངས་པ་རྗེས་སུ་དཔག །
en: “In this way, from the presence of karma, afflictions are inferred;

source: ཉོན་མོངས་པ་ལས་གང་ཟག་རྗེས་སུ་དཔག་གང་ཟག་ལས་འགྲོ་བ་རྗེས་སུ་དཔག །
en: from the presence of afflictions, individuals are inferred; from individuals, transmigrations are inferred;

source: འགྲོ་བ་ལས་རྣམ་པར་སྨིན་པ་རྗེས་སུ་དཔག །
en: from transmigrations, types of ripening are inferred;

source: རྣམ་པར་སྨིན་པ་ལས་འཁོར་བ་རྗེས་སུ་དཔག །
en: from the presence of types of ripening, cyclic existence is inferred;

source: འཁོར་བ་ལས་འཁོར་བའི་སྡུག་བསྔལ་རྗེས་སུ་དཔག །
en: from the presence of cyclic existence, the suffering of cyclic existence is inferred;

source: འཁོར་བའི་སྡུག་བསྔལ་ལས་ལས་དང་ཉོན་མོངས་པ་རྗེས་སུ་དཔག །
en: and from the presence of the suffering of cyclic existence, karma and afflictions are inferred.

source: སྡུག་བསྔལ་དང་ཀུན་ནས་ཉོན་མོངས་པ་དེ་ཟད་ན་ངེས་པར་འབྱུང་སྟེ།
en: When suffering and the afflictions come to an end, there is freedom.

source: ཉོན་མོངས་པ་ཟད་པས་ལས་ཟད།
en: When afflictions come to an end, karma comes to an end.

source: ལས་ཟད་པས་མངོན་པར་མི་འགྲུབ་སྟེ།
en: When karma comes to an end, there is no formation.

source: གང་མངོན་པར་མ་གྲུབ་ན་དེ་མྱ་ངན་ལས་འདས་པ་ཡིན་ནོ། །
en: When there is no formation, that is nirvāṇa.

source: དེ་གང་གིས་མྱ་ངན་ལས་འདས་པ་ཡིན་ཞེ་ན།
en: What leads to nirvāṇa, you may ask?

source: སྡུག་བསྔལ་འདིའི་མྱ་ངན་ལས་འདས་པ་ཡིན་ཏེ་འདི་ལྟ་སྟེ་དཔེར་ན་ཤིང་བསྡུས་པ་ལས་མེ་འབར་རོ། །
en: Nirvāṇa is the transcendence of this very suffering, just as rubbing sticks together sets them ablaze,

source: ཤིང་ཟད་ན་མེ་འཆི་སྟེ་འདིར་གཞན་གང་ཡང་མེ་མ་ཡིན་གྱི་ཤིང་གང་ཟད་ན་འཆིའོ། །
en: yet the fire dies when the wood runs out. There is no other fire than that—when the wood is finished the fire dies.

source: དེ་བཞིན་དུ་ལས་དང་ཉོན་མོངས་པ་ཟད་ན་མྱ་ངན་ལས་འདའ་སྟེ་
en: In the same way, when karma and afflictions come to an end, one transcends suffering.

source: འདིར་གཞན་གང་ཡང་སྡུག་བསྔལ་མ་ཡིན་གྱི་གང་དེའི་མྱ་ངན་ལས་འདའ་བ་ནི་ལས་དང་ཉོན་མོངས་པ་ཟད་པ་ལས་མྱ་ངན་ལས་འདའོ། །
en: There is no other suffering than that—that is the transcendence of suffering. Nirvāṇa happens when karma and afflictions come to an end.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མ་ཞེས་བྱ་བ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there appeared in the world a thus-gone, worthy, perfect buddha named Master of the Three Realms; he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྲམ་ཟེ་ཟླ་བའི་སྨིན་མ་ཞེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཞིག་བྱུང་སྟེ།
en: In the buddha realm of the thus-gone Master of the Three Realms there was a brahmin, who was similar to a sal tree, named Moon Eyebrows.

source: འདོན་པ་སྔགས་འཛིན་པ། རིག་པ་གསུམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྒྲ་ངེས་པར་སྦྱོར་བ་དང་། ཤེས་གསལ་དང་ལྔ་པ་སྟེ། སྔོན་བྱུང་བ་དང་བཅས་པ་དང་། ཚིག་གིས་ལུང་སྟོན་པ་དང་། འཇིག་རྟེན་རྒྱང་འཕེན་པ་དང་། མཆོད་སྦྱིན་གྱི་རྒྱུད་དང་།
en: He was a chanter and mantra holder, and had mastered the threefold knowledge, as well as grammar and ritual sciences, including history, rhetoric, the scriptures of the Lokāyata, and the scriptures on ritual offerings.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཉིད་ཀྱི་རིགས་དང་འཐུན་པར་རྗེས་སུ་སྐྱེས་པ།
en: He was born into the lineage of those with the characteristics of a great being.

source: རང་གི་སློབ་དཔོན་གྱི་གསུང་རབ་རིག་པ་གསུམ་ལམ་མགུ་ནས་དགེ་བའི་ཆོས་ཚོལ་ཏེ
en: “He was not satisfied with his teacher’s instructions or the threefold knowledge and so sought out virtuous teachings.

source: དེ་བྲམ་ཟེ་ཀུན་གྱིས་རྗེས་སུ་ཤེས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་ཅིང་། འཇིག་རྟེན་རྒྱང་འཕེན་པའི་རྒྱུད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ། གསོ་བའི་དཔྱད་ཀྱི་རྒྱུད་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ། མཚན་མའི་རྒྱུད་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ། སྒྱུ་མའི་བསྟན་བཅོས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འདི་ལྟ་སྟེ།
en: He had mastered all the knowledge shared by all brahmins, had mastered the scriptures of the Lokāyata, had mastered all the scriptures on medicine, had mastered all the scriptures on characteristics, and had mastered all the scriptures on magic, thus

source: མིག་འཕྲུལ་དང་། ཉེ་བའི་མིག་འཕྲུལ་དང་། ཐགས་ཟངས་རིས་ཀྱི་འཕྲུལ་དང་། རབ་བཅོམ་གྱི་འཕྲུལ་དང་། རུས་པའི་འཕྲུལ་དང་། བདེ་མཆོག་གི་འཕྲུལ་དང་། གཞོན་ནུ་རྩེ་བ་དང་། རིག་སྔགས་འཆང་རྩེ་བ་དང་། ཕྱི་རོལ་གྱི་ཚོགས་ཀྱི་རྫུ་འཕྲུལ་གྱི་རྩེ་བ་དང་། དེ་ལས་གཞན་པའི་རྩེ་བའི་བསྟན་བཅོས་དཔག་ཏུ་མེད་པ་དག་ལ་འཇིགས་པ་མེད་དོ། །
en: becoming confident in the scriptures on optical illusions, visual tricks, illusions of Vemacitra, illusions of destruction, illusions of skeletons, illusions of Saṃvara, children’s tricks, vidyādharas’ tricks, the miraculous tricks of non-Buddhist orders, and countless other types of tricks.

source: བྲམ་ཟེ་ཟླ་བའི་སྨིན་མ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དེ་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མ་ཞེས་བྱ་བ་ནས། རིག་པ་དང་ཞབས་སུ་ལྡན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་ཏུ་བྱུང་སྟེ།
en: The brahmin Moon Eyebrows, who was similar to a sal tree, heard that there had appeared in the world a thus-gone named Master of the Three Realms—who was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one, a worthy one, a perfect buddha—and

source: དེས་མི་མཁྱེན་པའམ། མ་གཟིགས་པའམ། ཐུགས་སུ་མ་ཆུད་པའམ། མངོན་སུམ་དུ་མ་མཛད་པ་ཅི་ཡང་མེད་དོ་ཞེས་ཐོས་སོ། །
en: moreover that there was nothing at all he had not understood, seen, realized, or actualized.

source: དེ་ལྟ་ན་བདག་གི་སྔགས་ཀྱི་ལུང་དག་ལས་གང་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པའི་སྐྱེས་བུ་ཆེན་པོ་ནི་རྣམ་པ་གཉིས་སུ་འགྱུར་ཏེ། གཞན་དུ་ནི་མ་ཡིན་ནོ། །
en: He thought, ‘Any great being who comes to possess the thirty-two marks of a great being other than by my mantra teachings must be one of two types, and could not be anything else.

source: གལ་ཏེ་ཁྱིམ་ན་གནས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་ཏེ། གླིང་བཞིའི་དབང་ཕྱུག་རྣམ་པར་རྒྱལ་ཞིང་
en: If he is a house dweller, he will become a universal emperor, ruling as lord over the four continents.

source: ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་ཏེ།
en: As a spiritually inclined Dharma king, he will possess the seven treasures.

source: དེའི་རིན་པོ་ཆེ་སྣ་བདུན་ནི་འདི་དག་ཡིན་ནོ། །འདི་ལྟ་སྟེ་འཁོར་ལོ་རིན་པོ་ཆེ་དང་། གླང་པོ་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བུད་མེད་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བློན་པོ་རིན་པོ་ཆེ་སྟེ་འདི་བདུན་ནོ། །
en: The seven treasures are the precious wheel, the precious elephant, the precious horse, the precious jewel, the precious queen, the precious steward, and the precious minister.

source: ཡང་བུ་སྟོང་ཚང་བར་ཡོད་དེ།
en: He will have a full thousand children.

source: དཔའ་ཞིང་རྟུལ་ཕོད་པ་ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ་ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམ་པ་ཡིན་ཏེ།
en: He will be brave and courageous and have a body endowed with extraordinary features with which he will conquer opposing forces.

source: དེ་སའི་དཀྱིལ་འཁོར་འདི་ཆད་པ་མེད་པ་དང་། མཚོན་གྱིས་བདའ་བ་མེད་པར་རང་གི་ཆོས་འབའ་ཞིག་གིས་ཤིན་ཏུ་གནས་སོ། །
en: Without any coercion by weapons, his Dharma will extend everywhere throughout the earth.

source: གལ་ཏེ་སྐྲ་དང་ཁ་སྤུ་བྲེགས་གོས་ངུར་སྨྲིག་གྱོན་ཏེ་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ། །
en: “ ‘If, on the other hand, he shaves his hair and beard, dons the saffron robes, and devotedly leaves his home to become a homeless renunciant, he will become a thus-gone, worthy, perfect buddha, learned and venerable, a blissful one, a knower of the world, a steersman who guides beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: གང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མ་དེ། གལ་ཏེ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་འདི་དང་ལྡན་ནམ་འོན་ཏེ་མི་ལྡན་པ་བདག་གིས་བརྟག་གོ། །
en: I must examine whether this blessed thus-gone named Master of the Three Realms possesses the thirty-two marks of a great being or not.

source: གལ་ཏེ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པར་མཐོང་ན། དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བར་ཤེས་སོ་སྙམ་མོ། །
en: If I see that he does possess the thirty-two marks of a great being, I will know that he is to be regarded as a thus-gone.’

source: དེ་ནས་བྲམ་ཟེ་ཟླ་བའི་སྨིན་མ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དྲུག་ཅུ་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མ་དེ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: “With that the brahmin Moon Eyebrows, who was similar to a sal tree, paid a visit to the blessed thus-gone Master of the Three Realms along with sixty other great brahmin householders.

source: དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མ་དང་ལྷན་ཅིག་མངོན་དུ་ཡང་དག་པར་དགའ་བའི་གཏམ་གྱི་རྣམ་པ་དག་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: After exchanging pleasantries with Thus-Gone One Master of the Three Realms, they sat off to one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས། བྲམ་ཟེ་ཟླ་བའི་སྨིན་མ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མ་དེའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དག་བསམས་སོ། །
en: Sitting to the side, the brahmin Moon Eyebrows, who was similar to a sal tree, wondered about the blessed thus-gone Master of the Three Realms’ thirty-two marks of a great being.

source: བྲམ་ཟེ་ཟླ་བའི་སྨིན་མ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དག་མཐོང་སྟེ།
en: Then he saw that the blessed thus-gone Master of the Three Realms indeed had the thirty-two marks of a great being.

source: ཟླ་བའི་སྨིན་མས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མ་དེའི་སྐུ་ལ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་གཞན་གཉིས་དང་གཉིས་དག་གི་དྲན་པ་འདི་ལྟ་སྟེ། མདོམས་ཀྱི་སྦ་བ་སྦུབས་སུ་ནུབ་པ་དང་། ལྗགས་རིང་བ་ལ་སོམ་ཉི་ཟའོ། །
en: Moon Eyebrows wondered, however, about two of blessed thus-gone Master of the Three Realms’ marks of a great being in particular: he had doubts about whether his genitals were concealed in a sheath and whether his tongue was long.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མ་དེས་བྲམ་ཟེ་ཟླ་བའི་སྨིན་མ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས། ཞལ་ནས་ལྗགས་ཕྱུང་སྟེ་སྤྱན་དང་སྙན་གྱི་འགྲམ་པ་གཉིས་ལ་ལྗགས་ཀྱིས་ཀུན་ཏུ་ཉུག་པར་མཛད། ཀུན་རེག་པར་མཛད། ལྗགས་ཀྱིས་སྙན་གྱི་རྒྱུད་གཉིས་ལ་ཡོངས་སུ་ཉུག་པར་མཛད། ཀུན་ཏུ་ཉུག་པར་མཛད་དེ།
en: “The blessed thus-gone Master of the Three Realms was aware of the brahmin Moon Eyebrows’ thoughts, and so he extended his tongue from his mouth to lick both his cheeks entirely from eye to ear before licking his ear lobes.

source: མཚན་མ་ཇི་ལྟ་བུ་འབྱུང་བར་མཛད་པ་དེ་ལྟ་བུའི་མཚན་མ་འབྱུང་བར་མཛད་པས་བྲམ་ཟེ་ཟླ་བའི་སྨིན་མ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་མདོམས་ཀྱི་སྦ་བ་སྦུབས་སུ་ནུབ་པར་མཐོང་ངོ་། །
en: Witnessing such signs, exactly as they ought to appear, the great brahmin householder also saw that the Thus-Gone One’s genitals were indeed concealed in a sheath.

source: དེ་དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ལ་སོམ་ཉི་མེད།
en: Thus, he no longer had any reservations about the Thus-Gone One’s thirty-two marks of a great being.

source: ཐེ་ཚོམ་མེད་ནས་དེ་སྟན་ལས་ལངས་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་
en: Without any doubts, he stood up from his seat and knelt on his right knee.

source: དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: Joining his palms, he bowed toward the thus-gone Master of the Three Realms.

source: དེ་བཞིན་གཤེགས་པ་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཅིང་། ཁས་གཏུགས་ཏེ་ལག་པ་གཉིས་ཀྱིས་ཤིན་ཏུ་བཏེག་ནས།
en: Bowing to his feet, he kissed them, and then raised them up.

source: བཅོམ་ལྡན་འདས་བྲམ་ཟེ་ཟླ་བའི་སྨིན་མ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཞེས་བགྱི་བ་ལགས་སོ། །
en: He then said, ‘Blessed One, I am the brahmin Moon Eyebrows, who is similar to a sal tree.

source: བཅོམ་ལྡན་འདས་བྲམ་ཟེ་ཟླ་བའི་སྨིན་མ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཞེས་བགྱི་བ་ལགས་སོ་ཞེས། བདག་གི་མིང་དང་རུས་ལན་གསུམ་གྱི་བར་དུ་གསོལ་ཏོ། །
en: Blessed One, I am the brahmin Moon Eyebrows, who is similar to a sal tree,’ repeating his name and family line three times.

source: སེམས་ཀྱང་འདི་ལྟར་བསྐྱེད་དོ། །
en: He then formed the thought,

source: བདག་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་གྱུར་ནས་
en: ‘May I become a thus-gone, worthy, perfect buddha in the future, and then

source: མ་དུལ་བ་རྣམས་འདུལ་བ་དང་།
en: guide those who have not been guided,

source: མ་གྲོལ་བ་རྣམས་དགྲོལ་བ་དང་།
en: liberate those who have not been liberated,

source: མ་ཞི་བ་རྣམས་ཞི་བར་བགྱིད་པ་དང་།
en: pacify those who have not been pacified,

source: མ་རྒལ་བ་རྣམས་བསྒྲལ་བ་དང་།
en: free those who have not crossed,

source: དབུགས་མ་ཕྱིན་པ་རྣམས་དབུགས་དབྱུང་བ་དང་།
en: revitalize those who have not been revitalized,

source: ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བ་དང་།
en: bring those who have not reached nirvāṇa to nirvāṇa, and

source: ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་འདྲེན་པར་གྱུར་ཅིག །
en: become a guide of the whole world including the gods.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མ་དེས་བྲམ་ཟེ་ཟླ་བའི་སྨིན་མ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་འཛུམ་པ་མཛད་དོ། །
en: “The thus-gone Master of the Three Realms was aware of the great brahmin householder Moon Eyebrows’ thoughts, and so he smiled.

source: འདི་ནི་ཆོས་ཉིད་དེ་གང་གི་ཚེ། བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པ་དེའི་ཚེ། འོད་ཟེར་ཁ་དོག་དུ་མ་དང་ཁ་དོག་སྣ་ཚོགས་དག་ཞལ་གྱི་སྒོ་ནས་བྱུང་སྟེ།
en: It is the nature of things that when blessed ones smile, light rays of a myriad colors emerge from their mouth.

source: དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མ་དེ་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་སྤྱི་གཙུག་ཏུ་ནུབ་བོ། །
en: The light now circled the thus-gone Master of the Three Realms three times before vanishing into the crown of his head.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེའི་རིམ་གྲོ་པ་དགེ་སློང་ཞི་བའི་དབང་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ
en: At that time the thus-gone’s chief attendant was the monk Śāntendra.

source: དེ་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས།
en: He now stood up from his seat and draped his shawl over one shoulder.

source: དེ་བཞིན་གཤེགས་པ་དེ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: Joining his palms, he bowed toward the blessed thus-gone Master of the Three Realms and supplicated in verse:

source: འདྲེན་པ་དཔའ་ཆེན་རྒྱུ་མ་མཆིས་པར་འཛུམ་མི་མཛད། །གླང་པོ་ཆེན་པོ་འཛུམ་མཛད་རྒྱུ་ཅི་བདག་ལ་གསུངས། །
en: “ ‘Brave guide, you would not smile for no reason— Great elephant, please tell me why you smiled;

source: འདྲེན་པ་འཇིག་རྟེན་གསལ་མཛད་འཛུམ་པའི་རྒྱུ་གསུངས་ཤིག །
en: Guide who illuminates the world, please say why you smiled.

source: ཁྱོད་སྲས་གང་དག་ཐོས་ནས་མགུ་ཞིང་དགའ་བར་འགྱུར། །
en: When I hear it, your son will be pleased and delighted,

source: བརྩོན་འགྲུས་རྩོམ་ཞིང་སངས་རྒྱས་ཆོས་དག་འཐོབ་པར་འགྱུར། །
en: “ ‘Become diligent and achieve the qualities of buddhahood,

source: བདུད་ཀྱང་འཇོམས་པར་འགྱུར་ཞིང་ལམ་ཆེན་སྦྱོང་བར་འགྱུར། །
en: Vanquish demons and purify the great path,

source: འདྲེན་པ་སངས་རྒྱས་ཆོས་ལ་ངེས་པར་འབྱུང་འགྱུར་ཞིང་། །
en: Gain conviction in the teachings of the guide, the Buddha,

source: འདྲེན་པ་སངས་རྒྱས་ཆོས་ལ་ཐེ་ཚོམ་མེད་པར་འགྱུར། །
en: And lose all doubt about the qualities of the guide, the Buddha.

source: ཇི་ལྟར་སངས་རྒྱས་སྲས་ཀྱིས་འབད་པ་དོན་ཡོད་ཅིང་། །སློབ་ཚེ་འཇིགས་པ་མེད་ཅིང་ཞུམ་པ་མེད་པར་འགྱུར།
en: “ ‘Whatever this child of the Buddha strives in will be meaningful,

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གསུམ་གྱི་བླ་མ་དེས།
en: And I will be fearless and dauntless in my training.’

source: རིམ་གྲོ་པ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་གསུངས་པ།
en: “The thus-gone Master of the Three Realms then replied to his chief attendant in verse as well:

source: ཇི་ལྟར་སྨྲས་པ་དེ་བཞིན་རྒྱུ་མེད་འཛུམ་མི་མཛད། །
en: “ ‘As you say, I do not smile for no reason.

source: སྲས་ཀྱི་བསམ་པ་མཁྱེན་ནས་འཇིག་རྟེན་དོན་གྱི་ཕྱིར། །
en: Aware of my child’s thoughts and to help the world,

source: སེམས་ཅན་འཇིག་རྟེན་དོན་དུ་འདྲེན་པ་འཛུམ་པ་མཛད། །
en: The Guide smiled to benefit the world and beings.

source: བྲམ་ཟེ་ཟླ་བའི་སྨིན་མ་དཔའ་བོ་མཁས་པ་འདི། །ང་ལ་མཆོད་པ་བྱས་ཤིང་བསྟན་ལ་དད་པ་རྙེད། །
en: “ ‘The wise and brave brahmin named Moon Eyebrows Venerated me and gained faith in the teachings.

source: བསྐལ་པ་བྱེ་བ་དྲུག་ཅུར་ལོག་པར་མི་འགྲོ་ཞིང་། །དེ་ནས་མི་རུ་འོངས་ནས་འཇིག་རྟེན་སངས་རྒྱས་འགྱུར། །
en: For six hundred million eons he will not go astray, And then as a human he will become an awakened being.

source: མཚན་ནི་འཇིག་རྟེན་གསལ་མཛད་སེམས་ཅན་ཐུགས་བརྩེ་ལྡན། །
en: “ ‘Known as “World Illuminator,” he will be kind to beings.

source: དེ་ཡི་སྐུ་ཚེ་ལོ་ནི་བྱེ་བ་བརྒྱད་ཅུར་འགྱུར། །
en: He will live to be eight hundred million years,

source: ཉན་ཐོས་འཁོར་ནི་བྱེ་བ་བདུན་ཅུ་དག་ཏུ་འགྱུར། །
en: And his retinue of hearers will number seven hundred million.

source: ལོ་ནི་བྱེ་བ་དགུ་བཅུར་རྐང་གཉིས་མཆོག་གནས་ཏེ། །
en: He will remain as the supreme human for nine hundred million years.

source: ཉན་ཐོས་འདུས་པ་བརྒྱད་ཅུ་དེ་ཡི་རྣམ་པ་ནི། །དམིགས་མེད་གྲགས་པ་ཆེན་པོ་འདུས་པ་འབྱུང་བར་འགྱུར། །
en: “ ‘Eighty assemblies of hearers will manifest— Boundless assemblies of great renown.

source: བློ་མཆོག་ལྡན་པ་མྱ་ངན་འདས་པའི་དམ་ཆོས་ལོ། །ཁྲི་ཕྲག་བརྒྱད་ཅུར་གནས་ཏེ་ལྷ་མི་དག་གིས་སྤྱོད། །
en: His wise, sublime teachings that transcend suffering will remain For eight hundred thousand years, employed by gods and humans.’

source: དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་ཟླ་བའི་སྨིན་མ་ཞེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། དེ་ལྟར་མི་བལྟ་སྟེ་
en: In case you may think that at that time the brahmin Moon Eyebrows, who was similar to a sal tree, was anyone else, Maudgalyāyana, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་ཟླ་བའི་སྨིན་མ་ཞེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་ཏོ། །
en: In those days I was the great brahmin householder Moon Eyebrows.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་བློ་ལ་དད་པ་མང་དུ་བྱ། བསྟན་བཅོས་ཐམས་ཅད་ལ་མཁས་པར་ཡང་བྱ་མངོན་པར་བརྩོན་པར་ཡང་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should have their minds full of faith, become learned in every scripture, and exert themselves diligently.”

source: མཽད་གལ་གྱི་བུ་ངས་ཁམས་སྣ་ཚོགས་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ནི་ཇི་ལྟར་ཁམས་སྣ་ཚོགས་ཤེས་པ་ཡང་དག་པར་བསྡུས་པས་སེམས་ཅན་རྣམས་ཀྱི་ཁམས་སྣ་ཚོགས་དག་གི་ཁམས་ཀྱི་གཉེན་པོ་དེས་པས་ཇི་ལྟར་ཆོས་བསྟན་པར་བྱ་སྙམ་ནས་
en: “Maudgalyāyana, in order to understand the various elements, when I was training as a bodhisattva in the past, I gathered understanding of the various elements and in doing so gained certainty in the elements that constitute remedies to the various elements of sentient beings.

source: དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་ཏེ།
en: Then, contemplating how to teach the Dharma, I created countless roots of virtue.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་དགེ་བའི་མིག་ཅེས་བྱ་བ་ནས། རང་གི་ཆོས་ཀྱིས་ཤིན་ཏུ་རྒྱལ་སྲིད་ཀྱི་ནང་ན་གནས་པའི་བར་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king named Virtuous Vision, who maintained his kingdom in a righteous manner.

source: དེའི་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་ཐོགས་པ་མེད་པའི་སྤྱན་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་ཞེས་བྱ་བ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: At the same time there was also a thus-gone one named Unhindered Vision; he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐོགས་པ་མེད་པའི་སྤྱན་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ནི་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་དག་བྱུང་ངོ་། །
en: The thus-gone, worthy, perfect buddha Unhindered Vision had a buddha realm consisting of a number of trichiliocosms equal to the amount of grains of sand in the Ganges River.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་གང་ཀུན་ནས་ཉོན་མོངས་པའི་ཚུལ་ཁྲིམས་སམ། ཀུན་ནས་ཉོན་མོངས་པའི་སེམས་ཅན་ཐམས་ཅད་དུ་གང་མ་སྐྱེས་ཏེ།
en: In that buddha realm no sentient beings were born who had disturbed discipline, nor, for that matter, any beings with any afflictions.

source: སྔོན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དང་། དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པ་ཐོགས་པ་མེད་པའི་སྤྱན་དེ་ཉིད་དང་ལྷན་ཅིག་ཏུ་དགེ་བའི་རྩ་བ་བསྐྱེད་དོ། །
en: All those beings, who had in the past formed roots of virtue with perfect buddhas, now also formed roots of virtue in the presence of the thus-gone Unhindered Vision.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཐོགས་པ་མེད་པའི་སྤྱན་གྱིས་སེམས་ཅན་དེ་དག་གི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དག་གི་བསྔགས་པ་བརྗོད་དེ།
en: The thus-gone Unhindered Vision was aware of all those beings’ thoughts, and so he proceeded to praise the thus-gone ones’ ten powers:
